esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam3s/svd/SAM3S2C.svd
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>ELMR%s</name>
          <description>PWM Event Line 0 Mode Register</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSEL0</name>
              <description>Comparison 0 Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL1</name>
              <description>Comparison 1 Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL2</name>
              <description>Comparison 2 Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL3</name>
              <description>Comparison 3 Selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL4</name>
              <description>Comparison 4 Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL5</name>
              <description>Comparison 5 Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL6</name>
              <description>Comparison 6 Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL7</name>
              <description>Comparison 7 Selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMMR</name>
          <description>PWM Stepper Motor Mode Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GCEN0</name>
              <description>Gray Count ENable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GCEN1</name>
              <description>Gray Count ENable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOWN0</name>
              <description>DOWN Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOWN1</name>
              <description>DOWN Count</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPCR</name>
          <description>PWM Write Protect Control Register</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WPCMD</name>
              <description>Write Protect Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WPRG0</name>
              <description>Write Protect Register Group 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WPRG1</name>
              <description>Write Protect Register Group 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WPRG2</name>
              <description>Write Protect Register Group 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WPRG3</name>
              <description>Write Protect Register Group 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WPRG4</name>
              <description>Write Protect Register Group 4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WPRG5</name>
              <description>Write Protect Register Group 5</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protect Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>PWM Write Protect Status Register</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WPSWS0</name>
              <description>Write Protect SW Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPSWS1</name>
              <description>Write Protect SW Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPSWS2</name>
              <description>Write Protect SW Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPSWS3</name>
              <description>Write Protect SW Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPSWS4</name>
              <description>Write Protect SW Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPSWS5</name>
              <description>Write Protect SW Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPVS</name>
              <description>Write Protect Violation Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPHWS0</name>
              <description>Write Protect HW Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPHWS1</name>
              <description>Write Protect HW Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPHWS2</name>
              <description>Write Protect HW Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPHWS3</name>
              <description>Write Protect HW Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPHWS4</name>
              <description>Write Protect HW Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPHWS5</name>
              <description>Write Protect HW Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protect Violation Source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPV0</name>
          <description>PWM Comparison 0 Value Register</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CV</name>
              <description>Comparison x Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVM</name>
              <description>Comparison x Value Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPVUPD0</name>
          <description>PWM Comparison 0 Value Update Register</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CVUPD</name>
              <description>Comparison x Value Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CVMUPD</name>
              <description>Comparison x Value Mode Update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPM0</name>
          <description>PWM Comparison 0 Mode Register</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <description>Comparison x Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>Comparison x Trigger</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPR</name>
              <description>Comparison x Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPRCNT</name>
              <description>Comparison x Period Counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPR</name>
              <description>Comparison x Update Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPRCNT</name>
              <description>Comparison x Update Period Counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPMUPD0</name>
          <description>PWM Comparison 0 Mode Update Register</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CENUPD</name>
              <description>Comparison x Enable Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTRUPD</name>
              <description>Comparison x Trigger Update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPRUPD</name>
              <description>Comparison x Period Update</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CUPRUPD</name>
              <description>Comparison x Update Period Update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPV1</name>
          <description>PWM Comparison 1 Value Register</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CV</name>
              <description>Comparison x Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVM</name>
              <description>Comparison x Value Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPVUPD1</name>
          <description>PWM Comparison 1 Value Update Register</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CVUPD</name>
              <description>Comparison x Value Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CVMUPD</name>
              <description>Comparison x Value Mode Update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPM1</name>
          <description>PWM Comparison 1 Mode Register</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <description>Comparison x Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>Comparison x Trigger</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPR</name>
              <description>Comparison x Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPRCNT</name>
              <description>Comparison x Period Counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPR</name>
              <description>Comparison x Update Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPRCNT</name>
              <description>Comparison x Update Period Counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPMUPD1</name>
          <description>PWM Comparison 1 Mode Update Register</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CENUPD</name>
              <description>Comparison x Enable Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTRUPD</name>
              <description>Comparison x Trigger Update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPRUPD</name>
              <description>Comparison x Period Update</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CUPRUPD</name>
              <description>Comparison x Update Period Update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPV2</name>
          <description>PWM Comparison 2 Value Register</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CV</name>
              <description>Comparison x Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVM</name>
              <description>Comparison x Value Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPVUPD2</name>
          <description>PWM Comparison 2 Value Update Register</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CVUPD</name>
              <description>Comparison x Value Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CVMUPD</name>
              <description>Comparison x Value Mode Update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPM2</name>
          <description>PWM Comparison 2 Mode Register</description>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEN</name>
              <description>Comparison x Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>Comparison x Trigger</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPR</name>
              <description>Comparison x Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPRCNT</name>
              <description>Comparison x Period Counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPR</name>
              <description>Comparison x Update Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUPRCNT</name>
              <description>Comparison x Update Period Counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
